other-codes/openfoam-toolchain-with-gmsh-main/Simulation_Outputs/test_2/4_freestream_kwSST_cp/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RAS;

RAS
{
    RASModel        kOmegaSST;

    turbulence      on;

    printCoeffs     on;

    alphaK1     0.85; // default values: 0.85
    alphaK2     1.0; // 1.0
    alphaOmega1 0.5; // 0.5
    alphaOmega2 0.856; // 0.856
    beta1       0.075; // 0.075
    beta2       0.0828; // 0.0828
    betaStar    0.09; // 0.09 
    gamma1      0.55555556; // 0.55555556
    gamma2      0.44; // 0.44 
    a1          0.31; // 0.31
    b1          1.0; // 1.0
    c1          10.0; // 10.0
    F3          false; // false

}


// ************************************************************************* //
