other-codes/openfoam-toolchain-with-gmsh-main/Simulation_Outputs/test_2/4_freestream_kwSST_cp/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.14;

boundaryField
{

   inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    "_VARnameSTLwithoutExtension_.*"
    {
        type            nutUSpaldingWallFunction;
        value           $internalField;
    }

    topAndBottom
    {
        type            zeroGradient;
    }
    
    front
    {
        type            empty;
    }
	
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
